# PanelType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelType Class
Members See Also
---
An object that represents a curtain panel type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PanelType : FamilySymbol
```

Visual Basic
---
```text
Public Class PanelType _
	Inherits FamilySymbol
```

Visual C++
---
```text
public ref class PanelType : public FamilySymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..InsertableObject Autodesk.Revit.DB..::..FamilySymbol Autodesk.Revit.DB..::..PanelType
# See Also
PanelType Members
Autodesk.Revit.DB Namespace